#include <ansi.h>

inherit STD_ROOM;

private void create()
{
    ::create();
    set("short", YEL "装备铺" NOR);
    set("long", "这里是装备铺，你可以在这里买(buy)卖(sell)装备，这里还贴了一张购物说明(readme)。");
    setArea(3, -70, 24, 12);
    set("exits", ([
        "north" : __DIR__"-70,25,12",
        "south" : __DIR__"-70,23,12",
        "west" : __DIR__"-71,24,12",
        "east" : __DIR__"-69,24,12",
    ]));
    set("item_desc", ([
            "readme" : @README
+++++++++++++++++++++++++++++++++++++++++
+        商品列表：  list               +
+        查看商品：  show               +
+        购买物品：  buy                +
+        出售物品：  sell               +
+++++++++++++++++++++++++++++++++++++++++
        提示：你可以微信扫码付款^_^
    █████████████████████████████████
    ████ ▄▄▄▄▄ █ ▄▄ █▄ ███ ▄▄▄▄▄ ████
    ████ █   █ ██▄█▀█ ▀█ █ █   █ ████
    ████ █▄▄▄█ █ ▀▀▄▄▀ ███ █▄▄▄█ ████
    ████▄▄▄▄▄▄▄█ ▀▄▀▄█▄▀ █▄▄▄▄▄▄▄████
    ████  ▄▀█ ▄█ ▄██▄▀▄▀▄▄  ▄▀█  ████
    ████▄█ ▄█ ▄▄█▄ ▄▀█▀▄ ▄ ▄█ ▄█▄████
    █████▄▀▄█▀▄██▄  █▀█  ▀  ███▀ ████
    ████▄▄▀▀▄ ▄█  █ ▀██▄▀  ▀▀ ▄█▄████
    ████▄▄▄███▄▄ ▄▀▀▄▀█  ▄▄▄ ██▄▀████
    ████ ▄▄▄▄▄ █▀▀▀ ██▀▀ █▄█ ███▄████
    ████ █   █ ██ ▀ ▀██ ▄▄▄▄ █▀▀█████
    ████ █▄▄▄█ █ ██▄▀▄██▀ ▀  ▄█▄▄████
    ████▄▄▄▄▄▄▄█▄██▄▄███▄▄███▄██▄████
    █████████████████████████████████
README,
    ]));
    set("objects", ([
        WORLD_9_DIR "3/npc/dealer1" : 1,
    ]) );
    setup();
}

void init()
{
    add_action("readme", "readme");
}

int readme(string arg)
{
    write(query("item_desc")["readme"]);
    return 1;
}
