#include <ansi.h>

inherit STD_ROOM;

private void create()
{
    ::create();
    set("short", YEL "杂货铺" NOR);
    set("long", "这里是沃尔罗村的杂货铺，你可以在这里买(buy)卖(sell)物品，杂货铺还贴了一张购物说明(readme)。");
    setArea(1, 0, 0, 10);
    set("exits", ([
        "out" : ([
            "filename" : WORLD_9_DIR "1/village",
            "x_axis" : 17,
            "y_axis" : 15,
        ]),
    ]));
    set("item_desc", ([
            "readme" : @README
+++++++++++++++++++++++++++++++++++++++++
+        商品列表：  list               +
+        查看商品：  show               +
+        购买物品：  buy                +
+        出售物品：  sell               +
+++++++++++++++++++++++++++++++++++++++++
        提示：你可以微信扫码付款^_^
    █████████████████████████████████
    ████ ▄▄▄▄▄ █ ▄▄ █▄ ███ ▄▄▄▄▄ ████
    ████ █   █ ██▄█▀█ ▀█ █ █   █ ████
    ████ █▄▄▄█ █ ▀▀▄▄▀ ███ █▄▄▄█ ████
    ████▄▄▄▄▄▄▄█ ▀▄▀▄█▄▀ █▄▄▄▄▄▄▄████
    ████  ▄▀█ ▄█ ▄██▄▀▄▀▄▄  ▄▀█  ████
    ████▄█ ▄█ ▄▄█▄ ▄▀█▀▄ ▄ ▄█ ▄█▄████
    █████▄▀▄█▀▄██▄  █▀█  ▀  ███▀ ████
    ████▄▄▀▀▄ ▄█  █ ▀██▄▀  ▀▀ ▄█▄████
    ████▄▄▄███▄▄ ▄▀▀▄▀█  ▄▄▄ ██▄▀████
    ████ ▄▄▄▄▄ █▀▀▀ ██▀▀ █▄█ ███▄████
    ████ █   █ ██ ▀ ▀██ ▄▄▄▄ █▀▀█████
    ████ █▄▄▄█ █ ██▄▀▄██▀ ▀  ▄█▄▄████
    ████▄▄▄▄▄▄▄█▄██▄▄███▄▄███▄██▄████
    █████████████████████████████████
README,
    ]));
    set("objects", ([
        WORLD_9_DIR "1/npc/dealer" : 1,
    ]) );
    setup();
}

void init()
{
    add_action("readme", "readme");
}

int readme(string arg)
{
    write(query("item_desc")["readme"]);
    return 1;
}
