/*****************************************************************************
Copyright: 2019, Mud.Ren
File name: map_d.c
Description: 世界地图系统守护进程
Author: xuefeng
Version: v1.0
Date: 2019-04-01
*****************************************************************************/
nosave string *map = ({
    "天の箱舟",
    "ウォルロ地方",
    "キサゴナ遺跡",
    "セントシュタイン",
    "エラフィタ地方",
    "ほろびの森",
    "ルディアノ城",
    "東ベクセリア地方",
    "西ベクセリア地方",
    "封印のほこら",
    "アユルダーマ島",
    "ダーマの塔",
    "海辺の洞窟",
    "ベレンの岸辺",
    "カラコタ地方",
    "ビタリ平原",
    "ピタリ山",
    "サンマロウ地方",
    "サンマロウ北洞窟",
    "ビタリ海岸",
    "グビアナ砂漠",
    "グビアナ地下水道",
    "アシュバル地方",
    "ヤハーン湿地",
    "カルバド大草原",
    "ダダマルダ山",
    "カズチィチィ山",
    "カズチャ村",
    "エルマニオン雪原",
    "エルシオン地下校舎",
    "東ナザム地方",
    "西ナザム地方",
    "魔獣の洞窟",
    "竜の門",
    "ドミール火山",
    "ガナン帝国城",
    "絶望と憎悪の魔宮",
    "雪の宝の地図の洞窟",
    "土の宝の地図の洞窟",
    "遺跡の宝の地図の洞窟",
    "火の宝の地図の洞窟",
    "水の宝の地図の洞窟",
    "雨の島",
    "海",
});
