inherit STD_NPC;

void create()
{
    ::create("common", 1);
    set_name("小女孩", ({"girl"}));
    set("long", "这是一个小女孩，一直梦想长大后成为托拉佩塔城公主的侍女。");
    set("gender", "女性");
    set("action", ([
        "msg" : ({
            "我也好想像旅艺人一样周游世界呀，可是危险的魔物太多了。",
            "外面草原上的史莱姆好可爱呀，好想养一只哦～",
            "听说有平民冒险者在基萨格纳遗迹中转职成魔法师了，我也想去……",
            "听说有冒险者在探险中找到勇者之塔，里面有无穷无尽的魔物，好可怕呀！",
            "教堂坐标：(-130,35)，记得多去祈祷(pray)哦。",
            "旅店坐标：(-127,35)，很多冒险者去那里休息(sleep)呢。",
            "杂货店坐标：(-127,32)，在那里可以买卖装备和物品。",
            "村口坐标：(-130,30)，出村小心魔物哦。",
            "这里是村中心广场，如果你是路痴，可以记下这里的坐标(-130,32)哦。",
            "冒险者可以接受任务(help quest)哦，完成任务有丰厚的奖励呢",
        }),
        "chance" : 500,
    ]));
}
